Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData.CreateElectricalLoadAreas(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Creates electrical load areas on all the empty plan circuits of the given level.
Remarks:
Use the HasCircuitsWithoutElectricalLoadAreas to check whether there are empty plan circuits in which there are no electrical load areas, if there are empty plan circuits, this API will create electrical load areas on each of them, otherwise, it will create nothing.
In most cases, the electrical load areas will be created, updated and deleted automatically, but in some cases, there are some empty plan circuits and need to create electrical load areas on each of them.
doc:
The document where the created electrical load areas are.
levelId:
The base level on which the created electrical load areas exist.
phaseId:
The associated phase in which the created electrical load areas exist.
Returns:
The created electrical load areas.
Throws Autodesk.Revit.Exceptions.ArgumentException:
doc is not a project document.
-or-
The ElementId levelId is not a Level.
-or-
The id does not represent a valid phase.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Throws Autodesk.Revit.Exceptions.ModificationForbiddenException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
-or-
The document is being loaded, or is in the midst of another
sensitive process.
Throws Autodesk.Revit.Exceptions.ModificationOutsideTransactionException:
The document has no open transaction.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData.HasCircuitsWithoutElectricalLoadAreas(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId,Autodesk.Revit.DB.ElementId)
Checks whether there are any empty plan circuits in which there are no electrical load areas.
doc:
The document to check.
levelId:
The base level on which the empty plan circuits to check.
phaseId:
The associated phase in which the empty plan circuits to check.
Returns:
True if there are empty plan circuits in which there are no electrical load areas, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentException:
doc is not a project document.
-or-
The ElementId levelId is not a Level.
-or-
The id does not represent a valid phase.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
The document is in failure mode: an operation has failed,
and Revit requires the user to either cancel the operation
or fix the problem (usually by deleting certain elements).
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData.GetAreaBasedLoadIds
Gets the area based load ids of the electrical load area to be included.
Since:
2023

Autodesk.Revit.DB.Electrical.ElectricalLoadAreaData
Represents the electrical load area data.
Since:
2023